#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.lambda_function.data.external.archive_prepare[0]: Reading...
data.archive_file.lambda: Reading...
data.archive_file.lambda: Read complete after 0s [id=4d8dcb5bc76b080df01faa7097fdf922f4ef8272]
module.lambda_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=44bff5cf9d3bbdc1b23492ed2a878d920b789d7c]
module.lambda_function.null_resource.archive[0]: Refreshing state... [id=5035474130470447659]
module.s3_bucket.data.aws_partition.current: Reading...
module.s3_bucket.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_function.data.aws_partition.current: Reading...
module.s3_bucket.data.aws_region.current: Reading...
module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=image-generate]
module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/imageGenerator-lambda2]
module.s3_bucket.data.aws_caller_identity.current: Reading...
module.lambda_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_bucket.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_function.data.aws_caller_identity.current: Reading...
module.lambda_function.data.aws_region.current: Reading...
aws_dynamodb_table.profile: Refreshing state... [id=profile]
aws_apigatewayv2_api.api: Refreshing state... [id=ibnh5cj45g]
module.lambda_function.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.s3_bucket.data.aws_canonical_user_id.this[0]: Reading...
module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=imageGenerator-lambda2]
module.s3_bucket.data.aws_caller_identity.current: Read complete after 0s [id=730335392708]
module.lambda_function.data.aws_caller_identity.current: Read complete after 0s [id=730335392708]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/imageGenerator-API2]
module.s3_bucket.data.aws_canonical_user_id.this[0]: Read complete after 1s [id=7797a1854717fed9d22a1133797392ed0b42e6ceee5ae1b18e9fea2879fdd5ae]
module.lambda_function.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2207072877]
module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::730335392708:policy/imageGenerator-lambda2-logs]
aws_apigatewayv2_stage.apigateway: Refreshing state... [id=$default]
module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=imageGenerator-lambda2-20240404192252509500000001]
module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=imageGenerator-lambda2]
module.s3_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=image-generate]
module.s3_bucket.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=image-generate]
module.s3_bucket.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=image-generate]
module.s3_bucket.aws_s3_bucket_acl.this[0]: Refreshing state... [id=image-generate,private]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.lambda_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "imageGenerator-lambda2"
      ~ last_modified                  = "2024-04-04T19:23:01.006+0000" -> "2024-04-04T19:25:40.303+0000"
        tags                           = {
            "Name" = "terraform-imageGenerator-lambda"
        }
        # (22 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_apigatewayv2_integration.lambda["index"] will be created
  + resource "aws_apigatewayv2_integration" "lambda" {
      + api_id                                    = "ibnh5cj45g"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:lambda:us-east-1:730335392708:function:imageGenerator-lambda2"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_integration.lambda["profile-get"] will be created
  + resource "aws_apigatewayv2_integration" "lambda" {
      + api_id                                    = "ibnh5cj45g"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:lambda:us-east-1:730335392708:function:imageGenerator-lambda2"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_integration.lambda["profile-post"] will be created
  + resource "aws_apigatewayv2_integration" "lambda" {
      + api_id                                    = "ibnh5cj45g"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:lambda:us-east-1:730335392708:function:imageGenerator-lambda2"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.default_route will be created
  + resource "aws_apigatewayv2_route" "default_route" {
      + api_id             = "ibnh5cj45g"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "$default"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.lambda["index"] will be created
  + resource "aws_apigatewayv2_route" "lambda" {
      + api_id             = "ibnh5cj45g"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.lambda["profile-get"] will be created
  + resource "aws_apigatewayv2_route" "lambda" {
      + api_id             = "ibnh5cj45g"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /profile"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.lambda["profile-post"] will be created
  + resource "aws_apigatewayv2_route" "lambda" {
      + api_id             = "ibnh5cj45g"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /profile"
      + target             = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5035474130470447659" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1712258567090170000" -> "1712266859357482000"
            # (1 unchanged element hidden)
        }
    }

Plan: 8 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rauljrtafur, Action: `pull_request`*